Repository: cyyself/OpenTihui
Catalog: src/openTihui/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

source: “%@” was added to your Shortcuts.
zh_hans: “%@”已添加到你的快捷指令。
zh_hant: 「%@」已新增到你的快捷指令。

source: “Auto” lets a reply run up to the full context window.
zh_hans: “自动”可让回复使用至完整的上下文窗口。
zh_hant: 「自動」可讓回覆使用至完整的上下文視窗。

source: %lld downloading
zh_hans: %lld 个下载中
zh_hant: %lld 個下載中

source: %lld tokens
zh_hans: %lld 个词元
zh_hant: %lld 個詞元

source: About
zh_hans: 关于
zh_hant: 關於

source: Acknowledgements
zh_hans: 致谢
zh_hant: 致謝

source: Active backend
zh_hans: 当前后端
zh_hant: 目前後端

source: Add
zh_hans: 添加
zh_hant: 新增

source: Add a shortcut
zh_hans: 添加快捷指令
zh_hant: 新增快捷指令

source: Add an OpenAI-compatible API endpoint to use a cloud model.
zh_hans: 添加一个兼容 OpenAI 的 API 端点以使用云端模型。
zh_hant: 新增一個相容 OpenAI 的 API 端點以使用雲端模型。

source: Add API Endpoint
zh_hans: 添加 API 端点
zh_hant: 新增 API 端點

source: Add option
zh_hans: 添加选项
zh_hant: 新增選項

source: Add screenshot?
zh_hans: 添加截屏？
zh_hant: 新增截圖？

source: Add variable
zh_hans: 添加变量
zh_hant: 新增變數

source: Allow in keyboard chips
zh_hans: 允许用于键盘按钮
zh_hant: 允許用於鍵盤按鈕

source: Any (use loaded model)
zh_hans: 任意（使用已加载的模型）
zh_hant: 任意（使用已載入的模型）

source: API Key
zh_hans: API 密钥
zh_hant: API 金鑰

source: Apply
zh_hans: 应用
zh_hant: 套用

source: Applying…
zh_hans: 正在应用…
zh_hant: 正在套用…

source: Attach your latest screenshot
zh_hans: 附上你最新的截屏
zh_hant: 附上你最新的截圖

source: Audio clip
zh_hans: 音频片段
zh_hant: 音訊片段

source: Auto
zh_hans: 自动
zh_hant: 自動

source: Auto context
zh_hans: 自动上下文
zh_hant: 自動上下文

source: Auto-add recent screenshot
zh_hans: 自动添加最近的截屏
zh_hant: 自動加入最近的截圖

source: Auto-fill from clipboard
zh_hans: 从剪贴板自动填充
zh_hant: 從剪貼簿自動填入

source: Auto-refresh
zh_hans: 自动刷新
zh_hant: 自動刷新

source: Available Local Models
zh_hans: 可用本地模型
zh_hant: 可用本機模型

source: Base URL (e.g. https://api.openai.com/v1)
zh_hans: 基础 URL（例如 https://api.openai.com/v1）
zh_hant: 基礎 URL（例如 https://api.openai.com/v1）

source: Behavior
zh_hans: 行为
zh_hant: 行為

source: Better quality · vision · Q4_K_XL
zh_hans: 更好的质量 · 视觉 · Q4_K_XL
zh_hant: 更好的品質 · 視覺 · Q4_K_XL

source: Cancel
zh_hans: 取消
zh_hant: 取消

source: Carefully describe the image the user sends: identify the main objects, any visible text, and the overall scene. Be concise and factual.
zh_hans: 仔细描述用户发送的图片：识别主要物体、任何可见文字以及整体场景。简洁、客观。
zh_hant: 仔細描述使用者傳送的圖片：辨識主要物體、任何可見文字以及整體場景。簡潔、客觀。

source: Chat
zh_hans: 聊天
zh_hant: 聊天

source: Chat name
zh_hans: 聊天名称
zh_hant: 聊天名稱

source: Chat Settings
zh_hans: 聊天设置
zh_hant: 聊天設定

source: Chats
zh_hans: 聊天
zh_hant: 聊天

source: Checking…
zh_hans: 检测中…
zh_hant: 檢測中…

source: Choose which projector to pair with this model, or None to run it text-only. `./` means the file sits next to the model; other paths are relative to the Models folder. Applied the next time the model loads.
zh_hans: 选择与此模型配对的投影器（projector），或选择“无”以纯文本方式运行。“./”表示文件与模型在同一文件夹；其他路径相对于 Models 文件夹。下次加载模型时生效。
zh_hant: 選擇與此模型配對的投影器（projector），或選擇「無」以純文字方式執行。「./」表示檔案與模型在同一資料夾；其他路徑相對於 Models 資料夾。下次載入模型時生效。

source: Clear
zh_hans: 清除
zh_hant: 清除

source: Close
zh_hans: 关闭
zh_hant: 關閉

source: Configure keyboard actions
zh_hans: 配置键盘操作
zh_hant: 設定鍵盤操作

source: Context
zh_hans: 上下文
zh_hant: 上下文

source: Context length
zh_hans: 上下文长度
zh_hant: 上下文長度

source: Context, reasoning, sampling and image size for new chats and the keyboard’s “Generate in app”. Shortcuts use their own settings.
zh_hans: 用于新对话和键盘“在应用中生成”的上下文长度、推理、采样和图片尺寸。快捷指令使用各自的设置。
zh_hant: 用於新對話和鍵盤「在應用中生成」的上下文長度、推理、取樣和圖片尺寸。快捷指令使用各自的設定。

source: Copied — switch back & tap Insert
zh_hans: 已拷贝 — 切回并点按“插入”
zh_hant: 已拷貝 — 切回並點按「插入」

source: Copied — switch to the keyboard & tap Import
zh_hans: 已拷贝 — 切换到键盘并点按“导入”
zh_hant: 已拷貝 — 切換到鍵盤並點按「匯入」

source: Copy
zh_hans: 复制
zh_hant: 複製

source: Copy setup for keyboard
zh_hans: 拷贝键盘配置
zh_hant: 拷貝鍵盤設定

source: Couldn’t load model
zh_hans: 无法加载模型
zh_hant: 無法載入模型

# ctx %lld/%lld
source: ctx %1$lld/%2$lld
zh_hans: 上下文 %lld/%lld
zh_hant: 上下文 %lld/%lld

source: Default
zh_hans: 默认
zh_hant: 預設

source: Default (%@)
zh_hans: 默认（%@）
zh_hant: 預設（%@）

source: Default Generation Settings
zh_hans: 默认生成设置
zh_hant: 預設生成設定

source: Default Model
zh_hans: 默认模型
zh_hant: 預設模型

source: Default System Prompt
zh_hans: 默认系统提示词
zh_hant: 預設系統提示

source: Define variables (e.g. language) with a list of options; users pick a value per chat.
zh_hans: 定义带有选项列表的变量（例如语言）；用户在每个聊天中选择一个值。
zh_hant: 定義帶有選項清單的變數（例如語言）；使用者在每個聊天中選擇一個值。

source: Define variables with options; pick a value per chat from the bar above the composer.
zh_hans: 定义带选项的变量；在输入框上方的栏中为每个聊天选择一个值。
zh_hant: 定義帶選項的變數；在輸入框上方的列中為每個聊天選擇一個值。

source: Delete
zh_hans: 删除
zh_hant: 刪除

source: Done
zh_hans: 完成
zh_hant: 完成

source: Download
zh_hans: 下载
zh_hant: 下載

source: Download %@
zh_hans: 下载 %@
zh_hant: 下載 %@

source: Download from URL
zh_hans: 从网址下载
zh_hant: 從網址下載

source: Download recommended model
zh_hans: 下载推荐模型
zh_hant: 下載推薦模型

source: Download this model file?
zh_hans: 下载此模型文件？
zh_hant: 下載此模型檔案？

source: Downloaded and imported models appear here.
zh_hans: 下载和导入的模型会显示在这里。
zh_hant: 下載和匯入的模型會顯示在這裡。

source: Downloads
zh_hans: 下载
zh_hant: 下載

source: Downscale attached images so the longest side is at most this size before sending — fewer vision tokens, faster encoding, smaller files. “Original” keeps full resolution.
zh_hans: 发送前将附带的图片缩小到最长边不超过此尺寸 —— 更少的视觉 token、更快的编码、更小的文件。“原始尺寸”保留完整分辨率。
zh_hant: 傳送前將附帶的圖片縮小到最長邊不超過此尺寸 —— 更少的視覺 token、更快的編碼、更小的檔案。「原始尺寸」保留完整解析度。

source: Edit
zh_hans: 编辑
zh_hant: 編輯

source: Enable the keyboard
zh_hans: 启用键盘
zh_hant: 啟用鍵盤

source: Endpoint
zh_hans: 端点
zh_hant: 端點

source: Engine
zh_hans: 引擎
zh_hant: 引擎

source: Export
zh_hans: 导出
zh_hant: 匯出

source: Export as JSON
zh_hans: 导出为 JSON
zh_hant: 匯出為 JSON

source: Export as PDF
zh_hans: 导出为 PDF
zh_hant: 匯出為 PDF

source: Export Chat
zh_hans: 导出聊天
zh_hant: 匯出聊天

source: Export this chat
zh_hans: 导出此聊天
zh_hant: 匯出此聊天

source: File
zh_hans: 文件
zh_hant: 檔案

source: Finished
zh_hans: 已完成
zh_hant: 已完成

source: Fix Grammar
zh_hans: 修正语法
zh_hant: 修正文法

source: Fix the spelling and grammar of the user's message. Output only the corrected text.
zh_hans: 修正用户消息中的拼写和语法错误。只输出更正后的文本。
zh_hant: 修正使用者訊息中的拼字和文法錯誤。只輸出更正後的文字。

source: Full Access is required for AI generation (network) and inserting results from the clipboard. While typing in any app, long-press 🌐 and pick openTihui to switch to it.
zh_hans: AI 生成（网络）和从剪贴板插入结果需要“完全访问权限”。在任意应用中输入时，长按 🌐 并选择 openTihui 即可切换。
zh_hant: AI 生成（網路）和從剪貼簿插入結果需要「完全取用權限」。在任意應用程式中輸入時，長按 🌐 並選擇 openTihui 即可切換。

source: Generate
zh_hans: 生成
zh_hant: 生成

source: Generate in app
zh_hans: 在应用中生成
zh_hant: 在應用程式中生成

source: Generation settings
zh_hans: 生成设置
zh_hant: 生成設定

source: Google Gemma · vision + audio · Q2_K_XL
zh_hans: Google Gemma · 视觉 + 音频 · Q2_K_XL
zh_hant: Google Gemma · 視覺 + 音訊 · Q2_K_XL

source: GPU (Metal) acceleration isn’t available in the iOS Simulator — inference runs on CPU. It works on real devices.
zh_hans: GPU（Metal）加速在 iOS 模拟器中不可用 — 推理在 CPU 上运行。在真机上可用。
zh_hant: GPU（Metal）加速在 iOS 模擬器中不可用 — 推理在 CPU 上執行。在實機上可用。

source: GPU acceleration
zh_hans: GPU 加速
zh_hant: GPU 加速

source: GPU acceleration (Metal)
zh_hans: GPU 加速（Metal）
zh_hant: GPU 加速（Metal）

source: Image Recognition
zh_hans: 图像识别
zh_hant: 圖像辨識

source: Images
zh_hans: 图片
zh_hant: 圖片

source: Import
zh_hans: 导入
zh_hant: 匯入

source: Import from Files
zh_hans: 从文件导入
zh_hant: 從檔案匯入

source: Import Model
zh_hans: 导入模型
zh_hant: 匯入模型

source: Insert result
zh_hans: 插入结果
zh_hant: 插入結果

source: Instruction
zh_hans: 指令
zh_hant: 指令

# Keyboard chips (%lld/%lld)
source: Keyboard chips (%1$lld/%2$lld)
zh_hans: 键盘按钮（%lld/%lld）
zh_hant: 鍵盤按鈕（%lld/%lld）

source: Larger Gemma · vision + audio · Q2_K_XL
zh_hans: 更大的 Gemma · 视觉 + 音频 · Q2_K_XL
zh_hant: 更大的 Gemma · 視覺 + 音訊 · Q2_K_XL

source: Leave empty to use the global default. Reference variables as **$name** (blue) — tap one above the keyboard to insert it.
zh_hans: 留空则使用全局默认值。用 **$name** 引用变量（蓝色）— 点按键盘上方的变量即可插入。
zh_hant: 留空則使用全域預設值。用 **$name** 參照變數（藍色）— 點按鍵盤上方的變數即可插入。

source: Let this shortcut be chosen as a chip in the openTihui keyboard. Turn off for vision-only shortcuts (e.g. Image Recognition).
zh_hans: 允许此快捷指令作为 openTihui 键盘上的按钮。对仅视觉的快捷指令（例如图像识别）请关闭。
zh_hant: 允許此快捷指令作為 openTihui 鍵盤上的按鈕。對僅視覺的快捷指令（例如圖像辨識）請關閉。

source: Load
zh_hans: 加载
zh_hant: 載入

source: Loading %@…
zh_hans: 正在加载 %@…
zh_hant: 正在載入 %@…

source: Loading model…
zh_hans: 正在加载模型…
zh_hant: 正在載入模型…

source: Logs
zh_hans: 日志
zh_hant: 日誌

source: Make the user's message shorter and clearer, keeping the meaning. Output only the rewritten text.
zh_hans: 将用户的消息变得更简短、更清晰，同时保持原意。只输出改写后的文本。
zh_hant: 將使用者的訊息變得更簡短、更清晰，同時保持原意。只輸出改寫後的文字。

source: Max image size
zh_hans: 最大图片尺寸
zh_hant: 最大圖片尺寸

source: Message…
zh_hans: 消息…
zh_hant: 訊息…

source: Model
zh_hans: 模型
zh_hant: 模型

source: Model file (required)
zh_hans: 模型文件（必填）
zh_hant: 模型檔案（必填）

source: Model ID (e.g. gpt-4o-mini)
zh_hans: 模型 ID（例如 gpt-4o-mini）
zh_hant: 模型 ID（例如 gpt-4o-mini）

source: Model weights live in the app's **Models** folder, visible under “On My iPhone/iPad ▸ openTihui” in the Files app. Drop `.gguf` files there (and `mmproj-*.gguf` projectors for vision models) and pull to refresh.
zh_hans: 模型权重位于应用的 **Models** 文件夹中，可在“文件”应用的“我的 iPhone/iPad ▸ openTihui”下查看。将 `.gguf` 文件（以及视觉模型的 `mmproj-*.gguf` 投影器）放入其中，然后下拉刷新。
zh_hant: 模型權重位於應用程式的 **Models** 資料夾中，可在「檔案」應用程式的「我的 iPhone/iPad ▸ openTihui」下查看。將 `.gguf` 檔案（以及視覺模型的 `mmproj-*.gguf` 投影器）放入其中，然後下拉重新整理。

source: Models
zh_hans: 模型
zh_hant: 模型

source: Multimodal
zh_hans: 多模态
zh_hant: 多模態

source: Multimodal (load projector)
zh_hans: 多模态（加载投影器）
zh_hant: 多模態（載入投影器）

source: Multimodal projector
zh_hans: 多模态投影器
zh_hant: 多模態投影器

source: Multimodal projector (mmproj)
zh_hans: 多模态投影器 (mmproj)
zh_hant: 多模態投影器 (mmproj)

source: Multimodal projector (optional)
zh_hans: 多模态投影器（可选）
zh_hant: 多模態投影器（選填）

source: name
zh_hans: 名称
zh_hant: 名稱

source: Name
zh_hans: 名称
zh_hant: 名稱

source: New Chat
zh_hans: 新建聊天
zh_hant: 新增聊天

source: No Chats Yet
zh_hans: 还没有聊天
zh_hant: 尚無聊天

source: No logs yet. Load a model or run a generation to populate the log.
zh_hans: 暂无日志。加载模型或进行一次生成即可产生日志。
zh_hant: 尚無日誌。載入模型或進行一次生成即可產生日誌。

source: No models yet
zh_hans: 还没有模型
zh_hant: 尚無模型

source: No options → a free-text field.
zh_hans: 无选项 → 自由文本字段。
zh_hant: 無選項 → 自由文字欄位。

source: No shortcuts yet. Tap + to create one.
zh_hans: 还没有快捷指令。点按 + 创建一个。
zh_hant: 尚無快捷指令。點按 + 建立一個。

source: No variables yet. Add one, then reference it as **$name** in the system prompt.
zh_hans: 还没有变量。添加一个，然后在系统提示词中用 **$name** 引用它。
zh_hant: 尚無變數。新增一個，然後在系統提示中用 **$name** 參照它。

source: None
zh_hans: 全不选
zh_hant: 全不選

source: None (text only)
zh_hans: 无（仅文本）
zh_hant: 無（僅文字）

source: Not loaded
zh_hans: 未加载
zh_hant: 未載入

source: Not supported on this device
zh_hans: 此设备不支持
zh_hant: 此裝置不支援

source: OK
zh_hans: 好
zh_hant: 好

source: On-device
zh_hans: 设备端
zh_hant: 裝置端

source: On-device models load with the context length below; API endpoints ignore local settings.
zh_hans: 本地模型会按下方的上下文长度加载；API 端点会忽略本地设置。
zh_hant: 本機模型會按下方的上下文長度載入；API 端點會忽略本機設定。

source: Online API Endpoints
zh_hans: 在线 API 端点
zh_hant: 線上 API 端點

source: Open Settings
zh_hans: 打开设置
zh_hant: 打開設定

source: OpenAI-compatible cloud or LAN models. Keys are stored only on this device.
zh_hans: 兼容 OpenAI 的云端或局域网模型。密钥仅存储在此设备上。
zh_hant: 相容 OpenAI 的雲端或區域網路模型。金鑰僅儲存在此裝置上。

source: openTihui is built on these open-source projects. Tap to view their licenses.
zh_hans: openTihui 基于这些开源项目构建。点按可查看其许可证。
zh_hant: openTihui 基於這些開源專案構建。點按可查看其授權條款。

source: openTihui is open source — contributions are welcome!
zh_hans: openTihui 是开源项目 —— 欢迎贡献！
zh_hant: openTihui 是開源專案 —— 歡迎貢獻！

source: openTihui Keyboard
zh_hans: openTihui 键盘
zh_hant: openTihui 鍵盤

source: Option %lld
zh_hans: 选项 %lld
zh_hant: 選項 %lld

source: Options
zh_hans: 选项
zh_hant: 選項

source: Or use the **+** button to download from Hugging Face, a URL, the Files app, or add an API endpoint.
zh_hans: 或使用 **+** 按钮从 Hugging Face、网址、“文件”应用下载，或添加 API 端点。
zh_hant: 或使用 **+** 按鈕從 Hugging Face、網址、「檔案」應用程式下載，或新增 API 端點。

source: Or use the **+** button to pick a recommended model, download from a URL, import from the Files app, or add an API endpoint.
zh_hans: 或使用 **+** 按钮选择推荐模型、从 URL 下载、从“文件”App 导入，或添加 API 端点。
zh_hant: 或使用 **+** 按鈕選擇推薦模型、從 URL 下載、從「檔案」App 匯入，或新增 API 端點。

source: Original
zh_hans: 原始尺寸
zh_hant: 原始尺寸

source: Paste
zh_hans: 粘贴
zh_hant: 貼上

source: Paste direct download links to GGUF files (e.g. Hugging Face “resolve” URLs). Downloads continue in the background — track them in the Downloads section.
zh_hans: 粘贴 GGUF 文件的直接下载链接（例如 Hugging Face 的“resolve”网址）。下载会在后台继续 — 可在“下载”部分跟踪。
zh_hant: 貼上 GGUF 檔案的直接下載連結（例如 Hugging Face 的「resolve」網址）。下載會在背景繼續 — 可在「下載」部分追蹤。

source: Path
zh_hans: 路径
zh_hant: 路徑

source: Performance
zh_hans: 性能
zh_hant: 效能

source: Photos
zh_hans: 照片
zh_hant: 照片

source: Pick a model to always load for this shortcut, or “Any” to use whatever is loaded.
zh_hans: 选择此快捷指令始终加载的模型，或选择“任意”以使用当前已加载的模型。
zh_hant: 選擇此快捷指令始終載入的模型，或選擇「任意」以使用目前已載入的模型。

source: Polite
zh_hans: 礼貌
zh_hant: 禮貌

source: Preparing export…
zh_hans: 正在准备导出…
zh_hant: 正在準備匯出…

source: Privacy Policy
zh_hans: 隐私政策
zh_hant: 隱私權政策

source: Project
zh_hans: 项目
zh_hant: 專案

source: Quick fill
zh_hans: 快速填充
zh_hant: 快速填入

source: Reasoning
zh_hans: 推理
zh_hant: 推理

source: Recommended Models
zh_hans: 推荐模型
zh_hant: 推薦模型

source: Record Audio
zh_hans: 录制音频
zh_hant: 錄製音訊

source: Reference variables as **$name** (highlighted in blue). Tap one above the keyboard to insert it.
zh_hans: 用 **$name** 引用变量（以蓝色高亮）。点按键盘上方的变量即可插入。
zh_hant: 用 **$name** 參照變數（以藍色標示）。點按鍵盤上方的變數即可插入。

source: Refresh now
zh_hans: 立即刷新
zh_hant: 立即刷新

source: Regenerate
zh_hans: 重新生成
zh_hant: 重新生成

source: Remove projector
zh_hans: 移除投影器
zh_hant: 移除投影器

source: Renaming changes the display name only — the file on disk (%@) is unchanged.
zh_hans: 重命名仅更改显示名称 —— 磁盘上的文件（%@）保持不变。
zh_hant: 重新命名僅更改顯示名稱 —— 磁碟上的檔案（%@）保持不變。

source: Reply
zh_hans: 回复
zh_hant: 回覆

source: Reset all shortcuts to the built-in defaults? Your custom shortcuts will be removed.
zh_hans: 将所有快捷指令重置为内置默认值？你的自定义快捷指令将被移除。
zh_hant: 將所有快捷指令重設為內建預設值？你的自訂快捷指令將被移除。

source: Reset Shortcuts
zh_hans: 重置快捷指令
zh_hant: 重設快捷指令

source: Reset Shortcuts to Default
zh_hans: 重置快捷指令为默认
zh_hant: 重設快捷指令為預設

source: Restoring chat…
zh_hans: 正在恢复聊天…
zh_hant: 正在還原聊天…

source: Result
zh_hans: 结果
zh_hant: 結果

source: Rewrite the user's message to be warmer and more polite, keeping the meaning. Output only the rewritten text.
zh_hans: 将用户的消息改写得更温暖、更礼貌，同时保持原意。只输出改写后的文本。
zh_hant: 將使用者的訊息改寫得更溫暖、更禮貌，同時保持原意。只輸出改寫後的文字。

source: Sampling
zh_hans: 采样
zh_hant: 取樣

source: Save
zh_hans: 保存
zh_hant: 儲存

source: Say hello
zh_hans: 打个招呼
zh_hant: 打個招呼

source: Screenshot
zh_hans: 截屏
zh_hant: 截圖

source: Select All
zh_hans: 全选
zh_hant: 全選

source: Send a message to start the conversation.
zh_hans: 发送消息以开始对话。
zh_hant: 傳送訊息以開始對話。

source: Set
zh_hans: 确定
zh_hant: 確定

source: Set as Default
zh_hans: 设为默认
zh_hant: 設為預設

source: Settings
zh_hans: 设置
zh_hant: 設定

source: Settings ▸ General ▸ Keyboard ▸ Keyboards.
zh_hans: 设置 ▸ 通用 ▸ 键盘 ▸ 键盘。
zh_hant: 設定 ▸ 一般 ▸ 鍵盤 ▸ 鍵盤。

source: Share…
zh_hans: 分享…
zh_hant: 分享…

source: Shortcut
zh_hans: 快捷指令
zh_hant: 快捷指令

source: Shortcut imported
zh_hans: 已导入快捷指令
zh_hant: 已匯入快捷指令

source: Shortcuts
zh_hans: 快捷指令
zh_hant: 快捷指令

source: Shorter
zh_hans: 简短
zh_hant: 簡短

source: Size
zh_hans: 大小
zh_hant: 大小

source: Source on GitHub
zh_hans: 在 GitHub 上查看源码
zh_hant: 在 GitHub 上檢視原始碼

source: Speak
zh_hans: 朗读
zh_hant: 朗讀

source: Stateless (discard context)
zh_hans: 无状态（丢弃上下文）
zh_hant: 無狀態（捨棄上下文）

source: Stop
zh_hans: 停止
zh_hant: 停止

source: Suggest recent screenshot
zh_hans: 建议附带最近的截图
zh_hant: 建議附帶最近的截圖

source: Summarize the user's text into a few clear bullet points capturing the key information. Do not add opinions.
zh_hans: 将用户的文本总结为几条清晰的要点，提炼关键信息。不要加入个人观点。
zh_hant: 將使用者的文字總結為幾條清晰的要點，提煉關鍵資訊。不要加入個人觀點。

source: Summarizer
zh_hans: 摘要
zh_hant: 摘要

source: System Prompt
zh_hans: 系统提示词
zh_hant: 系統提示

source: Take Photo
zh_hans: 拍照
zh_hant: 拍照

source: Tap **Add New Keyboard…** and choose **openTihui**.
zh_hans: 点按 **添加新键盘…** 并选择 **openTihui**。
zh_hant: 點按 **新增鍵盤…** 並選擇 **openTihui**。

source: Tap **openTihui** in the list, then turn on **Allow Full Access**.
zh_hans: 在列表中点按 **openTihui**，然后开启 **允许完全访问**。
zh_hant: 在清單中點按 **openTihui**，然後開啟 **允許完全取用**。

source: Tap a shortcut to start a new chat pre-configured with its system prompt, model and settings — handy for translation, image recognition, summarizing, etc.
zh_hans: 点按快捷指令即可开始一个已预配置系统提示词、模型和设置的新聊天 — 适用于翻译、图像识别、摘要等。
zh_hant: 點按快捷指令即可開始一個已預先設定系統提示、模型和設定的新聊天 — 適用於翻譯、圖像辨識、摘要等。

source: Tap here, then switch to openTihui…
zh_hans: 点按这里，然后切换到 openTihui…
zh_hant: 點按這裡，然後切換到 openTihui…

source: Tap in this box, then long-press 🌐 (or tap it) to switch to the openTihui keyboard and test your actions right here.
zh_hans: 在此框中点按，然后长按 🌐（或点按它）切换到 openTihui 键盘，即可在此测试你的操作。
zh_hant: 在此框中點按，然後長按 🌐（或點按它）切換到 openTihui 鍵盤，即可在此測試你的操作。

source: Tap the compose button to start a conversation.
zh_hans: 点按撰写按钮以开始对话。
zh_hant: 點按撰寫按鈕以開始對話。

source: test
zh_hans: 测试
zh_hant: 測試

source: Text
zh_hans: 文本
zh_hant: 文字

source: Text to use
zh_hans: 要使用的文本
zh_hant: 要使用的文字

source: The default model is used for new chats (loaded when you start typing).
zh_hans: 默认模型用于新聊天（在你开始输入时加载）。
zh_hant: 預設模型用於新聊天（在你開始輸入時載入）。

source: The projector (mmproj) enables image / audio input for vision-language models such as Qwen-VL.
zh_hans: 投影器 (mmproj) 为 Qwen-VL 等视觉语言模型启用图像/音频输入。
zh_hant: 投影器 (mmproj) 為 Qwen-VL 等視覺語言模型啟用圖像/音訊輸入。

source: Then switch to the openTihui keyboard and tap **Import shortcuts from app** (it also loads automatically the first time). Enable it first in Settings ▸ General ▸ Keyboard ▸ Keyboards, and turn on Allow Full Access.
zh_hans: 然后切换到 openTihui 键盘并点按 **从应用导入快捷指令**（首次也会自动加载）。请先在 设置 ▸ 通用 ▸ 键盘 ▸ 键盘 中启用它，并开启“允许完全访问”。
zh_hant: 然後切換到 openTihui 鍵盤並點按 **從應用程式匯入快捷指令**（首次也會自動載入）。請先在 設定 ▸ 一般 ▸ 鍵盤 ▸ 鍵盤 中啟用它，並開啟「允許完全取用」。

source: Thinking effort
zh_hans: 思考强度
zh_hant: 思考強度

source: Thinking…
zh_hans: 思考中…
zh_hant: 思考中…

source: This device reports no GPU offload support; inference runs on CPU.
zh_hans: 此设备报告不支持 GPU 卸载；推理在 CPU 上运行。
zh_hant: 此裝置回報不支援 GPU 卸載；推理在 CPU 上執行。

source: This model has multiple projectors — choose which to pair (e.g. different quantizations). Applied the next time the model loads.
zh_hans: 此模型有多个投影器 — 选择要配对的一个（例如不同的量化）。在下次加载模型时生效。
zh_hant: 此模型有多個投影器 — 選擇要配對的一個（例如不同的量化）。在下次載入模型時生效。

source: This model is text-only
zh_hans: 此模型仅支持文本
zh_hant: 此模型僅支援文字

source: This model supports image input. Toggle it per chat in Chat Settings (Multimodal).
zh_hans: 此模型支持图像输入。可在“聊天设置”（多模态）中按聊天切换。
zh_hant: 此模型支援圖像輸入。可在「聊天設定」（多模態）中按聊天切換。

source: Thoughts
zh_hans: 思考
zh_hant: 思考

source: Tiny and fast · vision · Q4_K_XL
zh_hans: 小巧快速 · 视觉 · Q4_K_XL
zh_hant: 小巧快速 · 視覺 · Q4_K_XL

source: Toggling GPU reloads the current model to apply. The active backend (Metal/CPU) is shown in About.
zh_hans: 切换 GPU 会重新加载当前模型以生效。当前后端（Metal/CPU）显示在“关于”中。
zh_hant: 切換 GPU 會重新載入目前模型以生效。目前後端（Metal/CPU）顯示在「關於」中。

source: Translate the user's message from $from into $into. Output only the translation, with no extra commentary.
zh_hans: 将用户的消息从 $from 翻译成 $into。只输出译文，不要额外说明。
zh_hant: 將使用者的訊息從 $from 翻譯成 $into。只輸出譯文，不要額外說明。

source: Translator
zh_hans: 翻译
zh_hant: 翻譯

source: Try it out
zh_hans: 试一试
zh_hant: 試一試

source: Try the recommended **Qwen3.5 0.8B** — a small, fast, vision-capable model that runs well on-device.
zh_hans: 试试推荐的 **Qwen3.5 0.8B** — 一个小巧、快速、支持视觉、在设备上运行良好的模型。
zh_hant: 試試推薦的 **Qwen3.5 0.8B** — 一個小巧、快速、支援視覺、在裝置上運行良好的模型。

source: Turn off multimodal to save memory on text-only chats (skips loading the vision projector). Stateless answers each message with a fresh context — earlier turns stay in the transcript but aren't sent to the model, keeping the KV cache small (great for translation and other one-shot tasks).
zh_hans: 关闭多模态可在纯文本聊天中节省内存（跳过加载视觉投影器）。无状态模式以全新的上下文回答每条消息 — 之前的对话仍显示在记录中，但不会发送给模型，从而保持 KV 缓存较小（非常适合翻译等一次性任务）。
zh_hant: 關閉多模態可在純文字聊天中節省記憶體（跳過載入視覺投影器）。無狀態模式以全新的上下文回答每則訊息 — 之前的對話仍顯示在記錄中，但不會傳送給模型，從而保持 KV 快取較小（非常適合翻譯等一次性任務）。

source: Type or edit the text…
zh_hans: 输入或编辑文本…
zh_hant: 輸入或編輯文字…

source: Use an on-device model or a remote API endpoint. On-device models reload when changed; API endpoints connect on send.
zh_hans: 使用设备端模型或远程 API 端点。设备端模型在更改时重新加载；API 端点在发送时连接。
zh_hant: 使用裝置端模型或遠端 API 端點。裝置端模型在變更時重新載入；API 端點在傳送時連線。

source: Use selected lines
zh_hans: 使用所选行
zh_hant: 使用所選行

source: Use this result
zh_hans: 使用此结果
zh_hant: 使用此結果

source: Used for new chats that aren’t started from a shortcut. Context length, sampling and reasoning are tuned per-chat (Chat Settings) or in a Shortcut.
zh_hans: 用于非从快捷指令启动的新聊天。上下文长度、采样和推理可按聊天（聊天设置）或在快捷指令中调整。
zh_hant: 用於非從快捷指令啟動的新聊天。上下文長度、取樣和推理可按聊天（聊天設定）或在快捷指令中調整。

# Using %@%@.
source: Using %1$@%2$@.
zh_hans: 使用 %@%@。
zh_hant: 使用 %@%@。

source: Value
zh_hans: 值
zh_hant: 值

source: Variables
zh_hans: 变量
zh_hant: 變數

source: Variables (%lld)
zh_hans: 变量（%lld）
zh_hant: 變數（%lld）

source: Vision (image) support
zh_hans: 视觉（图像）支持
zh_hant: 視覺（圖像）支援

source: Weights and the multimodal projector download together from Hugging Face (unsloth quantizations). Need a different model? Use Download from URL or drop a GGUF into the Models folder in the Files app.
zh_hans: 模型权重与多模态投影器将一起从 Hugging Face 下载（unsloth 量化版本）。需要其他模型？使用“从 URL 下载”，或将 GGUF 文件放入“文件”App 的 Models 文件夹。
zh_hant: 模型權重與多模態投影器將一起從 Hugging Face 下載（unsloth 量化版本）。需要其他模型？使用「從 URL 下載」，或將 GGUF 檔案放入「檔案」App 的 Models 資料夾。

source: What should openTihui do?
zh_hans: openTihui 应该做什么？
zh_hant: openTihui 應該做什麼？

source: When the chat opens, prefill the composer with the clipboard text. After you take a screenshot, offer to attach it (tap Add) — it's never attached without your tap. Asks for Photos access. Works in normal chats and shortcuts.
zh_hans: 打开对话时用剪贴板文本预填输入框。截图后会提示是否附带（点按“添加”）—— 未经点按绝不会附带。需要照片访问权限。在普通对话和快捷指令中均有效。
zh_hant: 開啟對話時用剪貼簿文字預填輸入框。截圖後會提示是否附帶（點按「新增」）—— 未經點按絕不會附帶。需要照片存取權限。在一般對話和快捷指令中均有效。

source: When the chat opens, prefill the composer with the clipboard text. When you send, attach a screenshot taken in the last 30 seconds (asks for Photos access). Works in normal chats and shortcuts.
zh_hans: 聊天打开时，用剪贴板文本预填充输入框。发送时，附上最近 30 秒内截取的截屏（需请求照片访问权限）。在普通聊天和快捷指令中均有效。
zh_hant: 聊天開啟時，用剪貼簿文字預填輸入框。傳送時，附上最近 30 秒內擷取的截圖（需請求照片取用權限）。在一般聊天和快捷指令中均有效。

source: When the window fills, the oldest middle of the chat is auto-compacted (the system prompt is kept).
zh_hans: 当窗口填满时，聊天最旧的中间部分会被自动压缩（系统提示词会保留）。
zh_hant: 當視窗填滿時，聊天最舊的中間部分會被自動壓縮（系統提示會保留）。

source: Works with any OpenAI-compatible API — OpenAI, OpenRouter, Groq, Together, DeepSeek, or a self-hosted llama-server / Ollama. The key is stored only on this device.
zh_hans: 适用于任何兼容 OpenAI 的 API — OpenAI、OpenRouter、Groq、Together、DeepSeek，或自托管的 llama-server / Ollama。密钥仅存储在此设备上。
zh_hant: 適用於任何相容 OpenAI 的 API — OpenAI、OpenRouter、Groq、Together、DeepSeek，或自架的 llama-server / Ollama。金鑰僅儲存在此裝置上。

source: Write a reply to the user's message. Output only the reply.
zh_hans: 为用户的消息写一条回复。只输出回复内容。
zh_hant: 為使用者的訊息寫一則回覆。只輸出回覆內容。

source: You are a helpful, concise assistant.
zh_hans: 你是一个乐于助人、回答简洁的助手。
zh_hant: 你是一個樂於助人、回答簡潔的助手。

source: Your Shortcuts shown as chips in the keyboard, in this order. Drag to reorder, swipe to remove. Add or edit shortcuts in the Shortcuts tab.
zh_hans: 你的快捷指令按此顺序在键盘中显示为按钮。拖动可重新排序，滑动可移除。在“快捷指令”标签页中添加或编辑快捷指令。
zh_hant: 你的快捷指令按此順序在鍵盤中顯示為按鈕。拖曳可重新排序，滑動可移除。在「快捷指令」分頁中新增或編輯快捷指令。

source: 27B in ~3.9 GB (1-bit) · vision · needs a recent device
zh_hans: 27B 仅 ~3.9 GB（1-bit）· 视觉 · 需要较新的设备
zh_hant: 27B 僅 ~3.9 GB（1-bit）· 視覺 · 需要較新的裝置
